#Список морзе
MorseCode = {'A': '.-', 'B': '-...',
             'C': '-.-.', 'D': '-..', 'E': '.',
             'F': '..-.', 'G': '--.', 'H': '....',
             'I': '..', 'J': '.---', 'K': '-.-',
             'L': '.-..', 'M': '--', 'N': '-.',
             'O': '---', 'P': '.--.', 'Q': '--.-',
             'R': '.-.', 'S': '...', 'T': '-',
             'U': '..-', 'V': '...-', 'W': '.--',
             'X': '-..-', 'Y': '-.--', 'Z': '--..',
             '1': '.----', '2': '..---', '3': '...--',
             '4': '....-', '5': '.....', '6': '-....',
             '7': '--...', '8': '---..', '9': '----.',
             '0': '-----', ', ': '--..--', '.': '.-.-.-',
             '?': '..--..', '/': '-..-.', '-': '-....-',
             '(': '-.--.', ')': '-.--.-'}
#Для анкода
MorseUnCode = {'.-': 'A', '-...': 'B', '-.-.': 'C', '-..': 'D', '.': 'E', '..-.': 'F', '--.': 'G', '....': 'H',
               '..': 'I', '.---': 'J', '-.-': 'K', '.-..': 'L', '--': 'M', '-.': 'N', '---': 'O', '.--.': 'P',
               '--.-': 'Q',
               '.-.': 'R', '...': 'S', '-': 'T', '..-': 'U', '...-': 'V', '.--': 'W', '-..-': 'X', '-.--': 'Y',
               '--..': 'Z', '.----': '1', '..---': '2', '...--': '3', '....-': '4', '.....': '5', '-....': '6',
               '--...': '7', '---..': '8', '----.': '9', '-----': '0', '--..--': ', ', '.-.-.-': '.', '..--..': '?',
               '-..-.': '/', '-....-': '-', '-.--.': '(', '-.--.-': ')'}


def encode_to_morse(text):
    return ' '.join([MorseCode[i] for i in text.upper()])


def decode_from_morse(code):
    return ''.join([MorseUnCode[i] for i in code.split()])

def main():
    while True:
        answer = input('Раскодировать или закодировать?\nВведите "раскод" если хотите раскодировать, и '
                       '"закод" если хотите закодировать.\n')
        if answer == 'раскод':
            print(decode_from_morse(input('Введите код для расшифровки\n')))
        elif answer == 'закод':
            print(encode_to_morse(input('Введите код для зашифровки\n')))
        else:
            print('Введите корректную команду.')
main()